#include<iostream>
void print_hello(){
    std::cout<<"Ciallo";
}

// 保留的测试函数
//
// 好吧其实这个文件就是个废文件
// 所以我打算在这里写点东西
// 
// 2025/8/18
// 这是我的第一个像样的软件，之前做的虽然好看（好吧其实一点也不好看），但是那都是易语言本身就很好做UI而已，要说真正完整的创建、维护一个软件项目，这还是第一次
// 这个仓库还是不成熟的，毕竟我这个人目前就是一个不成熟的状态，为了做这个，前前后后查了很多资料，在此之前，我甚至不知道什么是rc文件，也根本不会写批处理（特别简单的除外）
// 看到那个HELPS文件夹了吗？其实那是我给自己放的，很多东西我都是现问的AI，怕自己忘了，就复制下来放了进去（笑）
// 这个软件并不是一个需要长期维护的东西，毕竟功能不是很复杂，后期无非就是搞搞UI什么的，所以很快我就会去尝试新项目，新项目可能是个音乐播放器吧，到时候就要真正的制作图形界面了
// 嗯...好像没什么要说的，就到这里了吧
//
//
// 2025/8/19
// 拿fuck-u-code查了一下自己的代码，结果得了40多分，改了改，最后稳定维持在了30多，不得不说这个项目我真不是特别了解，有些函数出现的真是莫名其妙的，看来还得多学
//